# -*- mode: org -*-
#+TITLE: My Emacs configuration file
#+AUTHOR: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+INFOJS_OPT:

These configurations represent my preferred version of Emacs, one that uses
=evil= everywhere it can and one that tries to be as minimalist as +I want+
possible.

Cool Emacs configs from cool people:

- [[https://github.com/caisah/emacs.dz][Lots of cool people]]
- [[https://github.com/hrs/dotfiles][hrs]] (he likes org-mode and evil)
- [[https://app-learninglab.inria.fr/gitlab/learning-lab/mooc-rr-ressources/blob/master/module2/ressources/rr_org/init.org][Konrad's and Arnaud's]]

* What packages you can find here

You can find the following packages in this configuration file:

#+BEGIN_SRC emacs-lisp :exports results
(shell-command
 "grep '\<use-package .*$' < config.org |
  awk '{print \"- \"$2}' |
  tr -d ')' |
  sed '1,10d' |
  sort > package-list.txt")
(shell-command-to-string "cat package-list.txt")
#+END_SRC

#+RESULTS:
#+begin_example
- aggressive-indent
- anzu
- auto-compile
- bash-completion
- bind-key
- clang-format
- cmake-ide
- company
- counsel
- counsel-projectile
- counsel-tramp
- cpputils-cmake
- dumb-jump
- engine-mode
- ess
- evil
- evil-collection
- evil-leader
- evil-matchit
- evil-mc
- evil-nerd-commenter
- evil-org
- evil-org-agenda
- evil-surround
- evil-visualstar
- exec-path-from-shell
- expand-region
- flycheck
- flycheck-pos-tip
- gruvbox-theme
- helpful
- hydra
- irony
- ivy
- midnight
- minions
- neotree
- no-littering
- org
- pdf-tools
- perspective
- projectile
- ranger
- rtags
- smart-mode-line
- toc-org
- tramp
- use-package-ensure-system-package
- vimish-fold
- windmove
- yasnippet
#+end_example

But anyway, enough chit-chat, lets start with the configurations!

